RestAssuredApiTesting.BDD/src/test/resources/testdata_materialpurchase/materialPurchaseData.json

{
  "id" : "8d9732cd-21ca-44f3-9fb4-1993e09e5bfc",
  "company_id" : "eb603e4c-3d94-4b37-9a23-1f5e89ca8f17",
  "remark" : "test - 2",
  "creator_company_user_id" : "f52caf46-41e0-4ab7-a143-86873203fecd",
  "party_company_user_id" : "ad68f28f-e84c-4ceb-9991-1dffd745f3c1",
  "project_id" : "a43a10ac-fa91-4ec3-ba8f-ac1dc944c4c9",
  "sub_category_id" : "",
  "invoice_id" : "c0c7e6af-2aa7-4bd8-8c93-2a5a826b8299",
  "material_ids" : [ "2c99c347-f988-46c7-9194-0cef5ee72243" ],
  "discount" : 20.0,
  "gst_amount" : 174.6,
  "other_amount" : 10.0,
  "material_amount" : 1144.6,
  "total_payable" : 1134.6,
  "sequence" : 105,
  "photos" : [ ],
  "purchase_date" : [ 2026, 3, 21, 11, 11, 45, 175000000 ],
  "vendor_reference_number" : "A-01",
  "delete" : 0,
  "created" : [ 2026, 4, 13, 11, 46, 7, 159349723 ],
  "updated" : [ 2026, 4, 13, 11, 46, 7, 395457034 ],
  "approval_flag" : "auto_approved",
  "monkey_patch_materials" : null,
  "monkey_patch_creator_company_user" : { },
  "monkey_patch_party_company_user" : { },
  "monkey_patch_is_editable" : 0,
  "monkey_patch_paid_amount" : 0.0,
  "monkey_patch_status" : "",
  "source_add" : null,
  "source_edit" : null,
  "monkey_patch_sub_category" : {
    "id" : "",
    "parent_id" : "",
    "creator" : "",
    "creator_company_user_id" : "",
    "company_id" : "",
    "type" : "",
    "text_en" : "",
    "text_hi" : "",
    "index" : 0,
    "used" : 0,
    "delete" : 0,
    "hidden" : 0,
    "created" : "0001-01-01T00:00:00Z",
    "updated" : "0001-01-01T00:00:00Z",
    "monkey_patch_children" : null,
    "monkey_patch_parent" : null,
    "color_hex" : ""
  },
  "monkey_patch_project" : {
    "id" : "",
    "type" : "",
    "name" : "",
    "contractor" : "",
    "contractor_company_user_id" : "",
    "creator" : "",
    "creator_company_user_id" : "",
    "bg_image" : "",
    "admins" : null,
    "admins_company_user_ids" : null,
    "workers_company_user_ids" : null,
    "customer_name" : "",
    "customer_contact" : 0,
    "customer_email" : "",
    "customer_company_name" : "",
    "customer_company_address" : "",
    "customer_gst" : "",
    "customer_profile_image" : "",
    "address" : "",
    "city" : "",
    "state" : "",
    "status" : "",
    "contact_book" : null,
    "is_engine" : 0,
    "duplicate_from" : "",
    "created" : "0001-01-01T00:00:00Z",
    "updated" : "0001-01-01T00:00:00Z",
    "contact_data" : null,
    "photos" : null,
    "location" : {
      "type" : "",
      "coordinates" : null
    },
    "google_address" : null,
    "allowed_features" : null,
    "estimated_cost" : 0,
    "progress" : 0,
    "start_date" : "0001-01-01T00:00:00Z",
    "end_date" : "0001-01-01T00:00:00Z",
    "monkey_patch_contractor_name" : "",
    "monkey_patch_contractor_company_user_name" : "",
    "monkey_patch_contractor_contact" : 0,
    "monkey_patch_contractor_profile_pic" : "",
    "monkey_patch_in_amount" : 0,
    "monkey_patch_out_amount" : 0,
    "monkey_patch_transaction_in_amount" : 0,
    "monkey_patch_transaction_out_amount" : 0,
    "company_id" : "",
    "monkey_patch_my_company_user" : {
      "id" : "",
      "company_id" : "",
      "company_role_id" : "",
      "role" : "",
      "type" : "",
      "creator" : "",
      "name" : "",
      "mobile" : 0,
      "mobile_verified" : 0,
      "user_id" : "",
      "gstin" : "",
      "party_id" : "",
      "legal_business_name" : "",
      "billing_address" : "",
      "hidden" : 0,
      "profile_pic" : "",
      "monkey_patch_policy_ids" : null,
      "monkey_patch_company_role" : {
        "id" : "",
        "role" : "",
        "name" : "",
        "description" : "",
        "company_id" : "",
        "creator_company_user_id" : "",
        "policy_ids" : null,
        "hidden" : 0,
        "delete" : 0,
        "created" : "0001-01-01T00:00:00Z",
        "updated" : "0001-01-01T00:00:00Z",
        "monkey_patch_policies" : null
      },
      "monkey_patch_user" : {
        "id" : "",
        "name" : "",
        "mobile" : 0,
        "country_code" : "",
        "profile_pic" : "",
        "mobile_verified" : 0,
        "invited" : 0,
        "invitation_count" : 0,
        "profession" : ""
      },
      "email" : ""
    },
    "monkey_patch_company_name" : "",
    "monkey_patch_team_member" : null,
    "monkey_patch_todo_count" : 0,
    "attendance_radius" : 0,
    "distance" : 0,
    "monkey_patch_primary_address" : {
      "id" : "",
      "company_id" : "",
      "creator_company_user_id" : "",
      "owner_id" : "",
      "address_type" : "",
      "address_title" : "",
      "address_gst" : "",
      "address_line_1" : "",
      "address_line_2" : "",
      "city" : "",
      "state" : "",
      "postal_code" : "",
      "country_code" : "",
      "location" : {
        "type" : "",
        "coordinates" : null
      },
      "google_address" : null,
      "primary" : 0,
      "delete" : 0,
      "created" : "0001-01-01T00:00:00Z",
      "updated" : "0001-01-01T00:00:00Z",
      "search" : "",
      "monkey_patch_country_config" : {
        "country_code" : "",
        "country_iso" : "",
        "country_name" : "",
        "created" : "0001-01-01T00:00:00Z",
        "minimum_digits" : 0,
        "maximum_digits" : 0,
        "login_channels" : null,
        "currency" : "",
        "flag" : "",
        "tax_slabs" : null,
        "tax_display_name" : "",
        "tax_value_display_name" : "",
        "published" : 0,
        "decimal_digit" : 0,
        "timezone" : ""
      }
    },
    "dimension" : "",
    "orientation" : "",
    "code" : ""
  },
  "monkey_patch_sync_data" : {
    "id" : "",
    "transaction_id" : "",
    "company_id" : "",
    "transaction_type" : "",
    "created" : [ 1, 1, 1, 0, 0 ],
    "updated" : [ 1, 1, 1, 0, 0 ],
    "delete" : 0
  },
  "meta_data" : {
    "can_edit" : 0,
    "can_update_approval_flag" : 0
  },
  "monkey_patch_invoice" : {
    "id" : "c0c7e6af-2aa7-4bd8-8c93-2a5a826b8299",
    "company_id" : "eb603e4c-3d94-4b37-9a23-1f5e89ca8f17",
    "creator_company_user_id" : "f52caf46-41e0-4ab7-a143-86873203fecd",
    "party_company_user_id" : "ad68f28f-e84c-4ceb-9991-1dffd745f3c1",
    "project_id" : "a43a10ac-fa91-4ec3-ba8f-ac1dc944c4c9",
    "category_id" : "c4881f7f-6345-405e-a4ee-f5c4088d47b2",
    "sub_category_id" : "",
    "feature_type" : "material",
    "feature_id" : "8d9732cd-21ca-44f3-9fb4-1993e09e5bfc",
    "invoice_type" : "expense",
    "status" : "unpaid",
    "total_payable" : 1134,
    "paid_amount" : 0,
    "sequence" : 109,
    "delete" : 0,
    "invoice_date" : "2026-03-21T11:11:45.175Z",
    "created" : "2026-04-13T11:46:07.375280698Z",
    "updated" : "2026-04-13T11:46:07.375280937Z",
    "approval_flag" : "auto_approved",
    "monkey_patch_settlement" : {
      "id" : "",
      "creator_company_user_id" : "",
      "party_company_user_id" : "",
      "project_id" : "",
      "invoice_id" : "",
      "cashbooktransaction_id" : "",
      "settled_amount" : 0,
      "delete" : 0,
      "created" : "0001-01-01T00:00:00Z",
      "updated" : "0001-01-01T00:00:00Z",
      "monkey_patch_settlement_date" : "0001-01-01T00:00:00Z"
    },
    "monkey_patch_retention_entry" : null,
    "monkey_patch_feature" : null,
    "monkey_patch_project" : {
      "id" : "",
      "type" : "",
      "name" : "",
      "contractor" : "",
      "contractor_company_user_id" : "",
      "creator" : "",
      "creator_company_user_id" : "",
      "bg_image" : "",
      "admins" : null,
      "admins_company_user_ids" : null,
      "workers_company_user_ids" : null,
      "customer_name" : "",
      "customer_contact" : 0,
      "customer_email" : "",
      "customer_company_name" : "",
      "customer_company_address" : "",
      "customer_gst" : "",
      "customer_profile_image" : "",
      "address" : "",
      "city" : "",
      "state" : "",
      "status" : "",
      "contact_book" : null,
      "is_engine" : 0,
      "duplicate_from" : "",
      "created" : "0001-01-01T00:00:00Z",
      "updated" : "0001-01-01T00:00:00Z",
      "contact_data" : null,
      "photos" : null,
      "location" : {
        "type" : "",
        "coordinates" : null
      },
      "google_address" : null,
      "allowed_features" : null,
      "estimated_cost" : 0,
      "progress" : 0,
      "start_date" : "0001-01-01T00:00:00Z",
      "end_date" : "0001-01-01T00:00:00Z",
      "monkey_patch_contractor_name" : "",
      "monkey_patch_contractor_company_user_name" : "",
      "monkey_patch_contractor_contact" : 0,
      "monkey_patch_contractor_profile_pic" : "",
      "monkey_patch_in_amount" : 0,
      "monkey_patch_out_amount" : 0,
      "monkey_patch_transaction_in_amount" : 0,
      "monkey_patch_transaction_out_amount" : 0,
      "company_id" : "",
      "monkey_patch_my_company_user" : {
        "id" : "",
        "company_id" : "",
        "company_role_id" : "",
        "role" : "",
        "type" : "",
        "creator" : "",
        "name" : "",
        "mobile" : 0,
        "mobile_verified" : 0,
        "user_id" : "",
        "gstin" : "",
        "party_id" : "",
        "legal_business_name" : "",
        "billing_address" : "",
        "hidden" : 0,
        "profile_pic" : "",
        "monkey_patch_policy_ids" : null,
        "monkey_patch_company_role" : {
          "id" : "",
          "role" : "",
          "name" : "",
          "description" : "",
          "company_id" : "",
          "creator_company_user_id" : "",
          "policy_ids" : null,
          "hidden" : 0,
          "delete" : 0,
          "created" : "0001-01-01T00:00:00Z",
          "updated" : "0001-01-01T00:00:00Z",
          "monkey_patch_policies" : null
        },
        "monkey_patch_user" : {
          "id" : "",
          "name" : "",
          "mobile" : 0,
          "country_code" : "",
          "profile_pic" : "",
          "mobile_verified" : 0,
          "invited" : 0,
          "invitation_count" : 0,
          "profession" : ""
        },
        "email" : ""
      },
      "monkey_patch_company_name" : "",
      "monkey_patch_team_member" : null,
      "monkey_patch_todo_count" : 0,
      "attendance_radius" : 0,
      "distance" : 0,
      "monkey_patch_primary_address" : {
        "id" : "",
        "company_id" : "",
        "creator_company_user_id" : "",
        "owner_id" : "",
        "address_type" : "",
        "address_title" : "",
        "address_gst" : "",
        "address_line_1" : "",
        "address_line_2" : "",
        "city" : "",
        "state" : "",
        "postal_code" : "",
        "country_code" : "",
        "location" : {
          "type" : "",
          "coordinates" : null
        },
        "google_address" : null,
        "primary" : 0,
        "delete" : 0,
        "created" : "0001-01-01T00:00:00Z",
        "updated" : "0001-01-01T00:00:00Z",
        "search" : "",
        "monkey_patch_country_config" : {
          "country_code" : "",
          "country_iso" : "",
          "country_name" : "",
          "created" : "0001-01-01T00:00:00Z",
          "minimum_digits" : 0,
          "maximum_digits" : 0,
          "login_channels" : null,
          "currency" : "",
          "flag" : "",
          "tax_slabs" : null,
          "tax_display_name" : "",
          "tax_value_display_name" : "",
          "published" : 0,
          "decimal_digit" : 0,
          "timezone" : ""
        }
      },
      "dimension" : "",
      "orientation" : "",
      "code" : ""
    }
  },
  "approval_comment" : "",
  "approved_by" : "",
  "monkey_patch_approved_by" : { },
  "due_days" : 0.0,
  "ship_to_address_id" : "",
  "bill_to_address_id" : "498502b3-e052-4d7b-82d3-3617de9a88cb",
  "ship_from_address_id" : "",
  "bil_from_address_id" : null,
  "monkey_patch_ship_to_address" : {
    "id" : "",
    "company_id" : "",
    "creator_company_user_id" : "",
    "owner_id" : "",
    "address_type" : "",
    "address_title" : "",
    "address_gst" : "",
    "address_line_1" : "",
    "address_line_2" : "",
    "city" : "",
    "state" : "",
    "postal_code" : "",
    "country_code" : "",
    "google_address" : null,
    "primary" : 0,
    "delete" : 0,
    "created" : [ 1, 1, 1, 0, 0 ],
    "updated" : [ 1, 1, 1, 0, 0 ],
    "search" : ""
  },
  "monkey_patch_bil_to_address" : null,
  "monkey_patch_ship_from_address" : {
    "id" : "",
    "company_id" : "",
    "creator_company_user_id" : "",
    "owner_id" : "",
    "address_type" : "",
    "address_title" : "",
    "address_gst" : "",
    "address_line_1" : "",
    "address_line_2" : "",
    "city" : "",
    "state" : "",
    "postal_code" : "",
    "country_code" : "",
    "google_address" : null,
    "primary" : 0,
    "delete" : 0,
    "created" : [ 1, 1, 1, 0, 0 ],
    "updated" : [ 1, 1, 1, 0, 0 ],
    "search" : ""
  },
  "monkey_patch_bill_from_address" : {
    "id" : "",
    "company_id" : "",
    "creator_company_user_id" : "",
    "owner_id" : "",
    "address_type" : "",
    "address_title" : "",
    "address_gst" : "",
    "address_line_1" : "",
    "address_line_2" : "",
    "city" : "",
    "state" : "",
    "postal_code" : "",
    "country_code" : "",
    "google_address" : null,
    "primary" : 0,
    "delete" : 0,
    "created" : [ 1, 1, 1, 0, 0 ],
    "updated" : [ 1, 1, 1, 0, 0 ],
    "search" : ""
  },
  "due_date" : [ 2026, 3, 21, 11, 11, 45, 175000000 ],
  "third_party_transaction_sync_data_id" : null
}